{
  "title": "Политика конфиденциальности Netowork",
  "effective_date": "Дата вступления в силу: 15 января 2023 г.",
  "table_of_contents": "Оглавление",
  "general": {
    "title": "1. Общие положения",
    "text1": "Настоящая Политика конфиденциальности (далее – «Политика») описывает, как Netowork LLC, регистрационный номер 123456789, расположенная по адресу Лимассол Авеню 15, Никосия, 2112, Кипр (далее – «Мы», «Наша компания», «Netowork», «нас» или «наш») собирает, использует, обрабатывает, хранит, передает, раскрывает и защищает персональные данные пользователей (далее – «Вы», «Пользователь», «ваш») при использовании веб-сайта Netowork.com и связанных сервисов, приложений, инструментов и функций (совместно именуемых «Сервисы»).",
    "text2": "Используя наши Сервисы, вы подтверждаете, что прочитали, поняли и соглашаетесь соблюдать настоящую Политику конфиденциальности. Если вы не согласны с какой-либо частью данной Политики, вы должны отказаться от использования наших Сервисов.",
    "text3": "Настоящая Политика является неотъемлемой частью наших Условий использования. Любые термины с заглавной буквы, не определенные в данной Политике, имеют значение, присвоенное им в Условиях использования.",
    "text4": "Мы стремимся защищать вашу конфиденциальность и обеспечивать безопасность вашей личной информации. Настоящая Политика объясняет наши практики в отношении сбора, использования и раскрытия вашей информации через использование наших Сервисов."
  },
  "legal_basis": {
    "title": "2. Правовые основания обработки",
    "text1": "Мы обрабатываем ваши персональные данные в соответствии с:",
    "items": [
      "Вашим согласием (которое вы можете отозвать в любое время)",
      "Выполнением договорных обязательств при использовании вами наших Сервисов",
      "Соблюдением юридических обязательств согласно применимому законодательству",
      "Нашими законными интересами, такими как улучшение наших Сервисов, обеспечение безопасности и выявление мошеннических действий",
      "Защитой ваших жизненно важных интересов или интересов другого лица"
    ],
    "text2": "Мы не будем обрабатывать ваши персональные данные для целей, несовместимых с теми, что раскрыты в настоящей Политике, без предоставления вам уведомления и, если применимо, получения вашего согласия."
  },
  "data_collection": {
    "title": "3. Сбор и использование данных",
    "text": "Мы собираем персональные данные для конкретных, явных и законных целей и не обрабатываем их далее способом, несовместимым с этими целями. Мы можем собирать и обрабатывать следующие категории персональной информации:",
    "categories": {
      "personal_identifiers": {
        "title": "3.1 Личные идентификаторы",
        "text": "Это включает:",
    "items": [
      "Имя, фамилия",
      "Адрес электронной почты",
      "Номер телефона",
          "ID пользователя и учетные данные",
          "Дата рождения",
          "Информация о профиле и предпочтениях",
          "Информация учетной записи социальных сетей (при подключении ваших аккаунтов социальных сетей)"
        ]
      },
      "technical_data": {
        "title": "3.2 Технические данные",
        "text": "Когда вы взаимодействуете с нашими Сервисами, мы автоматически собираем:",
        "items": [
          "IP-адрес",
          "Тип и версия браузера",
          "Операционная система",
          "Информация об устройстве (включая ID устройства и модель)",
          "Строки пользовательского агента",
          "Настройки часового пояса и языка",
          "Информация о сети",
          "Данные журналов и статистика использования"
        ]
      },
      "activity_data": {
        "title": "3.3 Данные активности",
        "text": "Информация о ваших взаимодействиях с нашими Сервисами:",
        "items": [
          "Просмотренные страницы или контент",
          "Используемые функции",
          "Поисковые запросы",
          "Данные о кликах",
          "Пользовательский контент",
          "Продолжительность и частота сессий",
          "Взаимодействия с другими пользователями",
          "Временные метки активности"
        ]
      },
      "location_data": {
        "title": "3.4 Данные о местоположении",
        "text": "Информация о вашем географическом местоположении:",
        "items": [
          "Точное местоположение (с вашего согласия, где это требуется)",
          "Приблизительное местоположение, определенное по IP-адресу",
          "Информация о городе и стране"
        ]
      },
      "financial_data": {
        "title": "3.5 Финансовая информация",
        "text": "Если применимо, мы можем обрабатывать:",
        "items": [
          "Данные о способе оплаты",
          "Адрес для выставления счета",
          "История транзакций",
          "Информация о подписке"
        ],
        "note": "Примечание: Полные данные платежных карт обрабатываются нашими платежными процессорами, а не непосредственно Netowork."
      }
    },
    "collection_methods": {
      "title": "3.6 Методы сбора",
      "text": "Мы собираем информацию различными способами:",
      "items": [
        "Непосредственное предоставление вами при регистрации, создании профиля или использовании наших Сервисов",
        "Автоматизированные технологии, такие как файлы cookies, веб-маяки и аналогичные технологии",
        "Сторонние источники, включая платформы социальных сетей (при связывании учетных записей), бизнес-партнеров и общедоступные источники",
        "Провайдеры аналитики и рекламные сети"
      ]
    },
    "purposes": {
      "title": "3.7 Цели обработки",
      "text": "Мы используем ваши персональные данные для следующих целей:",
      "items": [
        "Предоставление, поддержка и улучшение наших Сервисов",
        "Создание и управление вашей учетной записью",
        "Обработка транзакций и администрирование подписок",
        "Аутентификация пользователей и обеспечение безопасности",
        "Персонализация вашего опыта и контента",
        "Коммуникация с вами о наших Сервисах, обновлениях и рекламных предложениях",
        "Анализ шаблонов использования для улучшения функциональности",
        "Обнаружение и предотвращение мошеннических действий, нарушений безопасности и других потенциально запрещенных или незаконных действий",
        "Обеспечение соблюдения наших Условий использования и других юридических прав",
        "Соблюдение юридических обязательств"
      ]
    }
  },
  "data_sharing": {
    "title": "4. Передача данных третьим лицам",
    "text": "Мы ценим вашу конфиденциальность и не продаем вашу личную информацию. Однако мы можем делиться вашей информацией со следующими категориями получателей при определенных обстоятельствах:",
    "categories": {
      "service_providers": {
        "title": "4.1 Поставщики услуг",
        "text": "Сторонние поставщики, консультанты и поставщики услуг, которые выполняют услуги от нашего имени, включая:",
        "items": [
          "Провайдеры облачных услуг для инфраструктуры и хранения",
          "Процессоры платежей для обработки транзакций",
          "Службы поддержки клиентов",
          "Службы доставки электронной почты",
          "Провайдеры аналитики",
          "Службы безопасности и предотвращения мошенничества"
        ],
        "note": "Эти поставщики услуг обязаны по договору использовать персональную информацию только в той мере, в какой это необходимо для предоставления услуг нам и в соответствии с нашими инструкциями."
      },
      "business_transfers": {
        "title": "4.2 Деловые передачи",
        "text": "В связи с любым слиянием, продажей активов компании, финансированием или приобретением всего или части нашего бизнеса другой компанией пользовательская информация может быть передана или передана. Мы уведомим вас по электронной почте и/или заметным уведомлением на наших Сервисах о любом изменении в собственности или использовании вашей личной информации."
      },
      "legal_requirements": {
        "title": "4.3 Юридические требования",
        "text": "Мы можем раскрыть вашу информацию, если это требуется по закону или в ответ на действительные запросы государственных органов (например, суда или правительственного агентства). Мы также можем раскрыть вашу информацию для:",
        "items": [
          "Обеспечения соблюдения наших Условий использования и других соглашений",
          "Защиты и отстаивания наших прав или собственности",
          "Предотвращения или расследования возможных правонарушений в связи с Сервисами",
          "Защиты личной безопасности пользователей Сервисов или общественности",
          "Защиты от юридической ответственности"
        ]
      },
      "with_consent": {
        "title": "4.4 С вашего согласия",
        "text": "Мы можем делиться вашей личной информацией с третьими лицами, когда вы дали нам свое согласие на это."
      },
      "aggregated_data": {
        "title": "4.5 Агрегированные или де-идентифицированные данные",
        "text": "Мы можем делиться агрегированной или де-идентифицированной информацией, которая не может быть разумно использована для идентификации вас, для различных целей, включая улучшение наших Сервисов и разработку новых функций."
      }
    }
  },
  "international_transfers": {
    "title": "5. Международные передачи данных",
    "text1": "Мы работаем глобально и можем передавать вашу личную информацию в страны, отличные от вашей страны проживания, включая Кипр, где расположены наши основные серверы. Эти страны могут иметь законы о защите данных, отличные от законов вашей страны.",
    "text2": "При передаче вашей личной информации на международном уровне мы внедряем соответствующие меры защиты в соответствии с применимым законодательством для обеспечения защиты ваших данных. Эти меры могут включать:",
    "items": [
      "Стандартные договорные положения, утвержденные Европейской комиссией",
      "Обязательные корпоративные правила для передачи внутри нашей корпоративной группы",
      "Отступления для конкретных ситуаций, таких как ваше явное согласие",
      "Решения о адекватности, признающие определенные страны как обеспечивающие адекватную защиту"
    ],
    "text3": "Используя наши Сервисы, вы подтверждаете, что ваша личная информация может быть передана и обработана в странах, отличных от вашей страны проживания."
  },
  "data_protection": {
    "title": "6. Защита данных",
    "text1": "Мы внедряем соответствующие технические, организационные и физические меры защиты, предназначенные для защиты вашей личной информации от случайной потери и несанкционированного доступа, использования, изменения или раскрытия. Эти меры включают:",
    "items": [
      "Шифрование конфиденциальной личной информации как при передаче, так и в состоянии покоя",
      "Регулярные оценки безопасности и тестирование на проникновение наших систем",
      "Внедрение механизмов контроля доступа для ограничения доступа к личной информации",
      "Системы мониторинга для потенциальных нарушений безопасности",
      "Регулярное резервное копирование для предотвращения потери данных",
      "Обучение сотрудников практикам конфиденциальности и безопасности",
      "Физические меры безопасности на наших объектах"
    ],
    "text2": "Хотя мы стремимся защитить вашу личную информацию, ни один метод электронной передачи или хранения не является 100% безопасным. Поэтому мы не можем гарантировать абсолютную безопасность. Если у вас есть основания полагать, что ваше взаимодействие с нами больше не безопасно, пожалуйста, немедленно уведомите нас, связавшись с privacy@netowork.com."
  },
  "data_retention": {
    "title": "7. Хранение данных",
    "text1": "Мы храним вашу личную информацию столько времени, сколько необходимо для достижения целей, для которых мы её собрали, включая удовлетворение юридических, бухгалтерских или отчетных требований.",
    "text2": "Чтобы определить соответствующий период хранения, мы учитываем:",
    "items": [
      "Количество, характер и чувствительность личной информации",
      "Потенциальный риск вреда от несанкционированного использования или раскрытия",
      "Цели, для которых мы обрабатываем данные, и можем ли мы достичь этих целей другими средствами",
      "Применимые правовые, нормативные или договорные требования"
    ],
    "text3": "Когда нам больше не нужна ваша личная информация, мы безопасно удалим или анонимизируем её. В некоторых обстоятельствах мы можем псевдонимизировать вашу личную информацию (чтобы она больше не могла быть связана с вами) для исследовательских или статистических целей, в таком случае мы можем использовать эту информацию неопределенно долго без дальнейшего уведомления вас."
  },
  "cookies": {
    "title": "8. Файлы cookies и аналогичные технологии",
    "text1": "Наши Сервисы используют файлы cookies, веб-маяки, пиксели и аналогичные технологии отслеживания для улучшения вашего опыта, анализа использования и доставки персонализированного контента. Эти технологии собирают информацию о вашем устройстве, действиях при просмотре и шаблонах.",
    "categories": {
      "essential": {
        "title": "8.1 Необходимые cookies",
        "text": "Необходимы для работы наших Сервисов, например, для управления сеансами, аутентификации и безопасности. Эти файлы cookies нельзя отключить."
      },
      "functional": {
        "title": "8.2 Функциональные cookies",
        "text": "Обеспечивают расширенную функциональность и персонализацию, такие как языковые предпочтения и запоминание ваших настроек."
      },
      "analytics": {
        "title": "8.3 Аналитические и производительные cookies",
        "text": "Собирают информацию о том, как вы используете наши Сервисы, чтобы помочь нам улучшить их, например, какие страницы вы посещаете чаще всего."
      },
      "advertising": {
        "title": "8.4 Рекламные и таргетинговые cookies",
        "text": "Отслеживают ваши привычки просмотра для доставки рекламы, соответствующей вашим интересам."
      }
    },
    "text2": "Вы можете управлять своими предпочтениями в отношении файлов cookies через настройки вашего браузера. Однако отключение определенных файлов cookies может ограничить вашу способность использовать некоторые функции наших Сервисов.",
    "text3": "Для более подробной информации о файлах cookies, которые мы используем, и о том, как ими управлять, пожалуйста, обратитесь к нашей Политике использования файлов cookies."
  },
  "rights": {
    "title": "9. Ваши права",
    "text1": "В зависимости от вашей юрисдикции, у вас могут быть определенные права в отношении вашей личной информации, которые могут включать:",
    "items": [
      "Право на доступ: Запрос доступа к личной информации, которую мы храним о вас.",
      "Право на исправление: Запрос исправления неточной или неполной личной информации.",
      "Право на удаление: Запрос удаления вашей личной информации при определенных обстоятельствах.",
      "Право на ограничение обработки: Запрос ограничения обработки вашей личной информации.",
      "Право на переносимость данных: Получение вашей личной информации в структурированном, общеиспользуемом и машиночитаемом формате.",
      "Право на возражение: Возражение против обработки вашей личной информации для определенных целей.",
      "Право на отзыв согласия: Отзыв согласия в любое время, где мы полагаемся на согласие для обработки вашей личной информации.",
      "Право на подачу жалобы: Подача жалобы в надзорный орган."
    ],
    "text2": "Для осуществления ваших прав, пожалуйста, свяжитесь с нами, используя информацию, предоставленную в разделе 'Свяжитесь с нами'. Мы ответим на ваш запрос в течение срока, установленного применимым законодательством.",
    "text3": "Нам может потребоваться подтвердить вашу личность перед выполнением вашего запроса. В некоторых случаях мы можем быть не в состоянии выполнить ваш запрос, например, если у нас есть законные деловые или юридические основания для сохранения вашей информации. Если мы отклоним ваш запрос, мы объясним почему."
  },
  "children": {
    "title": "10. Конфиденциальность детей",
    "text1": "Наши Сервисы не направлены на лиц моложе 16 лет. Мы сознательно не собираем личную информацию от детей. Если вы являетесь родителем или опекуном и считаете, что ваш ребенок предоставил нам личную информацию, пожалуйста, свяжитесь с нами, чтобы мы могли удалить такую информацию.",
    "text2": "Если мы узнаем, что мы собрали личную информацию от ребенка младше 16 лет без проверяемого согласия родителей, мы предпримем шаги для удаления этой информации как можно быстрее."
  },
  "changes": {
    "title": "11. Изменения в Политике",
    "text1": "Мы можем обновлять настоящую Политику конфиденциальности время от времени в ответ на изменения правовых, технических или деловых событий. Когда мы обновляем нашу Политику конфиденциальности, мы принимаем соответствующие меры для информирования вас, соответствующие значимости вносимых нами изменений.",
    "text2": "Если мы внесем существенные изменения в настоящую Политику конфиденциальности, мы уведомим вас по электронной почте или через уведомление на нашем веб-сайте до того, как изменения вступят в силу. Мы рекомендуем вам периодически просматривать настоящую Политику конфиденциальности для получения последней информации о наших практиках конфиденциальности.",
    "text3": "Продолжение использования вами наших Сервисов после любых изменений в Политике конфиденциальности представляет собой ваше подтверждение изменений и ваше согласие соблюдать и быть связанным обновленной Политикой конфиденциальности."
  },
  "dispute_resolution": {
    "title": "12. Разрешение споров",
    "text1": "Если у вас есть какие-либо опасения или жалобы относительно наших практик конфиденциальности, пожалуйста, сначала свяжитесь с нами. Мы постараемся решить вашу проблему или жалобу.",
    "text2": "Если вы находитесь в Европейской экономической зоне, у вас есть право подать жалобу в ваш местный орган по защите данных, если вы не удовлетворены нашим ответом."
  },
  "contacts": {
    "title": "13. Свяжитесь с нами",
    "text1": "Если у вас есть какие-либо вопросы, опасения или запросы относительно настоящей Политики конфиденциальности или наших практик конфиденциальности, пожалуйста, свяжитесь с нашим Сотрудником по защите данных:",
    "email": "Email: privacy@netowork.com",
    "phone": "Телефон: +357 22 123456",
    "address": "Почтовый адрес: Netowork LLC, Лимассол Авеню 15, Никосия, 2112, Кипр",
    "form": "Онлайн-форма: Доступна на нашей странице «Связаться с нами»"
  },
  "california_residents": {
    "title": "14. Дополнительная информация для резидентов Калифорнии",
    "text1": "Если вы являетесь резидентом Калифорнии, у вас есть определенные права согласно Закону о конфиденциальности потребителей Калифорнии (CCPA) и Закону о правах на конфиденциальность Калифорнии (CPRA), включая:",
    "items": [
      "Право знать: Запрос раскрытия личной информации, которую мы собираем, используем, раскрываем и продаем о вас.",
      "Право на удаление: Запрос удаления вашей личной информации, с учетом определенных исключений.",
      "Право на исправление: Запрос исправления неточной личной информации.",
      "Право на отказ: Отказ от продажи или обмена вашей личной информацией для межконтекстной поведенческой рекламы.",
      "Право на ограничение использования: Ограничение использования и раскрытия конфиденциальной личной информации."
    ],
    "text2": "Мы не продаем вашу личную информацию, как определено в CCPA/CPRA. Мы не продавали вашу личную информацию в предшествующие 12 месяцев.",
    "text3": "Для осуществления ваших прав, пожалуйста, свяжитесь с нами, используя информацию, предоставленную в разделе 'Свяжитесь с нами', или посетите нашу страницу 'Не продавайте мою личную информацию'. Мы проверим ваш запрос, используя информацию, которую вы предоставляете."
  },
  "eea_residents": {
    "title": "15. Дополнительная информация для резидентов ЕЭЗ, Великобритании и Швейцарии",
    "text1": "Если вы находитесь в Европейской экономической зоне (ЕЭЗ), Великобритании (UK) или Швейцарии, у вас есть определенные права согласно Общему регламенту по защите данных (GDPR) или эквивалентным законам.",
    "text2": "Наша правовая основа для обработки вашей личной информации зависит от конкретной информации и контекста, в котором мы её собираем. Мы обычно обрабатываем вашу личную информацию только если:",
    "items": [
      "Нам нужно выполнить договор с вами",
      "Вы дали нам согласие на это",
      "Обработка в наших законных интересах и не переопределяется вашими правами",
      "Нам нужно соблюдать юридические обязательства"
    ],
    "text3": "Если у вас есть вопросы о правовой основе для обработки вашей личной информации, пожалуйста, свяжитесь с нами, используя информацию, предоставленную в разделе 'Свяжитесь с нами'."
  }
}
