{
  "notifications": [
    {
      "id": "1",
      "title": "Notification 1",
      "description": "A new topic is available to you",
      "userId": "1",
      "isUiSwitch": true
    },
    {
      "id": "2",
      "title": "Notification 1",
      "description": "Some event occurred",
      "userId": "1"
    },
    {
      "id": "3",
      "title": "Notification 2",
      "description": "Some event occurred",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "4",
      "title": "Notification 3",
      "description": "Some event occurred",
      "userId": "1",
      "href": "http://localhost:3000/admin"
    },
    {
      "id": "5",
      "title": "Notification 4",
      "description": "Some event occurred",
      "userId": "1"
    },
    {
      "id": "6",
      "title": "Notification 1",
      "description": "Some event occurred",
      "userId": "2"
    }
  ],
  "articles": [
    {
      "id": "1",
      "title": "Latest JavaScript Updates",
      "subtitle": "What new features appeared in JS in 2022?",
      "img": "https://teknotower.com/wp-content/uploads/2020/11/js.png",
      "views": 1022,
      "createdAt": "26.02.2020",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction",
          "paragraphs": [
            "One of the first code examples that beginners learn is the 'Hello, world!' program. Its purpose is to display a simple string on the screen.",
            "JavaScript is a powerful programming language that is supported both in browsers and on the server through Node.js. If you've never written JS code before, you're just a few steps away from your first program.",
            "There are many ways to run JavaScript code in the browser. The most common is connecting script files with the .js extension. However, code can also be embedded directly into HTML pages using the <script> tag. When the browser detects this tag, it executes the code inside it. You can read more about working with the script tag on w3schools.com. Let's look at a small example demonstrating how to work with a web page using JavaScript."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <p id=\"hello\"></p>\n    <script>\n      document.getElementById(\"hello\").innerHTML = \"Hello, world!\";\n    </script>\n  </body>\n</html>"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Connecting JavaScript to Pages",
          "paragraphs": [
            "JavaScript can be inline and external. Inline JS is written directly inside the HTML document, while external JS is connected as a separate file.",
            "To connect an external JavaScript file, the <script> tag with the src attribute is used. This allows separating code and content, making pages more manageable and scalable.",
            "The code example below demonstrates how to connect and execute JavaScript in a web browser."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://teknotower.com/wp-content/uploads/2020/11/js.png",
          "title": "Code example in editor"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const path = require('path');\nconst jsonServer = require('json-server');\n\nconst server = jsonServer.create();\nconst router = jsonServer.router(path.resolve(__dirname, 'db.json'));\n\nserver.use(jsonServer.defaults());\nserver.use(jsonServer.bodyParser);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Using JavaScript in Server Applications",
          "paragraphs": [
            "JavaScript is actively used not only in browsers but also on the server thanks to the Node.js platform. This allows developing scalable applications with a single codebase.",
            "With Node.js, you can work with files, databases, network requests, and many other functions. For example, using the json-server library, you can easily create a fake REST API for testing frontend applications."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://teknotower.com/wp-content/uploads/2020/11/js.png",
          "title": "JavaScript debugging in browser"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "JavaScript is a universal language suitable for both web development and server applications. Its popularity continues to grow thanks to convenience and a wide range of tools.",
            "Modern technologies such as ES6+, React, Vue.js, and others significantly simplify development and allow creating dynamic interfaces with minimal time investment."
          ]
        }
      ]
    },
    {
      "id": "2",
      "title": "Python news",
      "subtitle": "What's new in Python in 2022?",
      "img": "https://images.unsplash.com/photo-1677293130537-bb902c697c8b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1023,
      "createdAt": "26.02.2022",
      "userId": "2",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Main Python Innovations",
          "paragraphs": [
            "Python continues to actively develop, and several significant updates were introduced in 2022. One of the key events was the release of Python 3.10 and work on Python 3.11, which promises to be even faster and more convenient for developers.",
            "Among the main innovations are improved error messages, the introduction of structural patterns (match-case), and significant performance improvements. Python remains one of the most popular programming languages, actively used in web development, data analysis, machine learning, and many other fields.",
            "There were also important updates in the ecosystem - improvements in libraries such as Pandas, NumPy, and FastAPI make development even more convenient. Let's look at how to install the latest version of Python and try new features in code."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "import sys\nprint(f'Current Python version: {sys.version}')"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "How to Get Started with the New Python Version?",
          "paragraphs": [
            "If you want to try the new features of Python 3.10 or 3.11, you can simply install the latest version from python.org. You can use package managers like pyenv or use the standard installer for your operating system.",
            "To work with the new version, it's recommended to update the core libraries using pip. For example, to update all packages in a virtual environment, you can use the command:"
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1677293130537-bb902c697c8b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Python Logo"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "pip install --upgrade pip setuptools wheel"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "The Future of Python",
          "paragraphs": [
            "Python continues to develop rapidly. Future versions are expected to bring even more optimizations, performance improvements, and new capabilities.",
            "Developers are actively discussing possible syntax changes and the addition of new tools that will make the language even more convenient for both professional and beginner programmers."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1677293130537-bb902c697c8b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Example of using the walrus operator (:=) in Python"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Python remains one of the most in-demand programming languages. In 2022, many innovations were introduced that make it even more convenient for developers. Whether you use it for data analysis, web development, or machine learning, new versions will bring noticeable improvements in performance and usability."
          ]
        }
      ]
    },
    {
      "id": "3",
      "title": "Quantum Computing",
      "subtitle": "Fundamentals of Quantum Computing and its Potential",
      "img": "https://images.unsplash.com/photo-1617839625591-e5a789593135?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1340,
      "createdAt": "22.04.2022",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Quantum Computing",
          "paragraphs": [
            "Quantum computing represents a new approach to information processing based on the principles of quantum mechanics. It's not just the next step in computing evolution, but a completely different way of processing data.",
            "Quantum computers can solve problems that traditional computing systems would take many years to complete. This is due to the use of quantum bits, or qubits, which can exist in multiple states simultaneously, allowing quantum machines to perform many calculations in parallel.",
            "An important aspect of studying quantum computing is that it can solve optimization, cryptography, and modeling problems at a level unattainable for classical computers. We are on the threshold of a new era in computing technology."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Quantum Computing</h1>\n    <p>Demonstration of quantum algorithm operation.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "How Do Quantum Computers Work?",
          "paragraphs": [
            "Quantum computers work based on superposition and entanglement of qubits. Superposition allows a qubit to exist in multiple states simultaneously, while entanglement means that changing the state of one qubit instantly affects another, regardless of the distance between them.",
            "Understanding these principles is key to developing quantum algorithms that can significantly speed up data processing. For example, Shor's algorithm allows efficient factorization of large numbers, which is impossible to do on classical computers in reasonable time."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1617839625591-e5a789593135?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - principle of quantum entanglement"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const qiskit = require('qiskit');\n\nconst circuit = new qiskit.QuantumCircuit(2, 2);\n\ncircuit.h(0);\ncircuit.cx(0, 1);\n\nconst backend = qiskit.Aer.getBackend('qasm_simulator');\n\nconst shots = 1024;\nconst result = await qiskit.execute(circuit, backend, { shots }).result();"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "The Future of Quantum Computing",
          "paragraphs": [
            "Quantum computing has the potential to change many aspects of our world, from medicine to finance and cybersecurity. But to achieve this, many challenges related to developing stable and scalable quantum computers need to be overcome.",
            "Currently, we are at a stage where many companies and research groups are working on creating and improving quantum systems, and this field is actively developing. This opens doors for new opportunities and innovations in various industries."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1617839625591-e5a789593135?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - quantum architecture"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Quantum computing is a promising and rapidly developing field worth paying attention to. With each new discovery and development, we are getting closer to the moment when these technologies will become accessible and their application will become commonplace."
          ]
        }
      ]
    },
    {
      "id": "4",
      "title": "Economics in the COVID-19 Era",
      "subtitle": "Impact of the pandemic on global markets and future trends",
      "img": "https://images.unsplash.com/photo-1601382270349-49c15bddf738?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 980,
      "createdAt": "26.02.2023",
      "userId": "1",
      "type": [
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Economic Consequences of COVID-19",
          "paragraphs": [
            "The COVID-19 pandemic has had a significant impact on the global economy, causing large-scale changes in consumer habits, production processes, and financial markets. Quick actions by governments and organizations to mitigate the crisis consequences became crucial.",
            "Economic shocks caused by lockdowns and movement restrictions led to changes in demand for many goods and services. While some sectors, such as travel and restaurants, suffered the most, others, like technology and online commerce, experienced significant growth.",
            "Industries such as healthcare came into focus, and their role in the economy was reconsidered, leading to increased investment and innovation in this area."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Economics in the COVID-19 Era</h1>\n    <p>Analysis of changes in the global financial system.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Changes in Consumer Habits",
          "paragraphs": [
            "With the emergence of the pandemic, many consumers switched to online shopping, leading to increased interest in e-commerce. As a result, traditional business models were revised, and companies began to adapt more quickly to new conditions.",
            "The pandemic also led to increased demand for health and safety-related products. People began to take more active care of their health, which changed consumption patterns and created new market opportunities."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1601382270349-49c15bddf738?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - economic recovery graph"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const economicTrends = require('economic-trends');\n\neconomicTrends.analyzeImpact('COVID-19', { sectors: ['retail', 'tech', 'health'] });"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "The Future of Economy After the Pandemic",
          "paragraphs": [
            "The economy is in the process of recovery, and this opens up new opportunities for business and investment. Sustainability, innovation, and adaptation to digital technologies will become key factors in determining success in the post-pandemic world.",
            "Governments and international organizations must work on restoring economic growth and creating sustainable models that will take into account the lessons of the pandemic. It is important to develop a resilient economy ready for future challenges."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1601382270349-49c15bddf738?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - infographic on COVID-19's impact on the economy"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The COVID-19 pandemic has changed the economic landscape forever. Understanding these changes and adapting to them will be the foundation for creating a more sustainable and responsible economy in the future."
          ]
        }
      ]
    },
    {
      "id": "5",
      "title": "History of Artificial Intelligence",
      "subtitle": "Development of AI from first ideas to modern technologies",
      "img": "https://images.unsplash.com/photo-1666597107756-ef489e9f1f09?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1500,
      "createdAt": "20.06.2022",
      "userId": "1",
      "type": [
        "IT",
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Artificial Intelligence",
          "paragraphs": [
            "Artificial Intelligence (AI) is a field of computer science that focuses on creating systems capable of performing tasks that require human intelligence. These tasks include reasoning, speech recognition, decision making, and learning.",
            "Since the emergence of the AI concept in the mid-20th century, this field has undergone many changes and achievements. It began in the 1950s when scientists started developing the first algorithms that could imitate thinking processes.",
            "Since then, AI has developed significantly, and nowadays it finds applications in many areas, including medicine, finance, transportation, and entertainment."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>History of Artificial Intelligence</h1>\n    <p>Overview of key stages and achievements in artificial intelligence.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Main Stages of AI Development",
          "paragraphs": [
            "The first wave of interest in AI occurred in the 1950s-1960s, when scientists like Alan Turing proposed concepts that laid the foundation for further research. The emergence of the first neural networks was also a significant step forward.",
            "In the 1980s, interest in AI grew again thanks to successes in expert systems. However, by the 1990s, there was a decline due to limited computing power and lack of data.",
            "Since the early 2000s, AI technologies began to develop again thanks to increased computing power and availability of large amounts of data. Machine learning algorithms, and then deep learning, revolutionized this field."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1666597107756-ef489e9f1f09?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - development of artificial intelligence"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const aiDevelopment = require('ai-development');\n\naiDevelopment.trackProgress({ years: [1950, 1980, 2000], milestones: ['first neural network', 'expert systems', 'deep learning revolution'] });"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Modern Developments in AI",
          "paragraphs": [
            "Today, artificial intelligence is actively used in various industries. For example, in medicine, AI helps in diagnosing diseases and developing new treatment methods.",
            "Meanwhile in finance, AI allows analyzing huge amounts of data to predict market trends and manage risks. Currently, AI developments continue to amaze with their capabilities and open new horizons for innovation."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1666597107756-ef489e9f1f09?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - examples of AI usage"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The history of artificial intelligence is full of revelations and discoveries. With each new step, we get closer to creating systems that can not only process information but also learn, adapt, and make decisions. The future of AI continues to remain exciting and promising."
          ]
        }
      ]
    },
    {
      "id": "6",
      "title": "Environmental Pollution",
      "subtitle": "Analysis of Causes and Consequences of the Ecological Crisis",
      "img": "https://images.unsplash.com/photo-1704797771332-fca2526315dd?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 670,
      "createdAt": "13.07.2022",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to the Pollution Problem",
          "paragraphs": [
            "Environmental pollution is one of the most pressing problems of our time. It affects not only ecosystems but also human health, quality of life, and economic well-being.",
            "The main sources of pollution include industrial emissions, automobile transport, agriculture, and household waste. Each of these categories contributes to the deterioration of the environment.",
            "Understanding the causes and consequences of pollution plays a key role in developing effective strategies for its prevention and mitigation."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Environmental Pollution</h1>\n    <p>Overview of main causes and consequences of pollution.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Causes of Pollution",
          "paragraphs": [
            "1. Industrial emissions: factories and plants release dangerous chemicals and dioxins into the air and water bodies, thereby harming the environment.",
            "2. Automobile transport: exhaust gases containing carbon dioxide and nitrogen oxides contribute to smog formation and deteriorate air quality.",
            "3. Waste: improper waste management and lack of recycling also directly contribute to soil and water pollution."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1704797771332-fca2526315dd?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - spread of pollutants"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const pollutionData = require('pollution-data');\n\nconst globalPollution = pollutionData.getGlobalStatistics();\n\nconsole.log(globalPollution);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Consequences of Pollution",
          "paragraphs": [
            "Environmental pollution leads to decreased air quality, which directly affects human health. The rise in respiratory diseases, allergies, and cardiovascular diseases has become common.",
            "Moreover, ecosystems are also at risk: climate change, species extinction, and deterioration of biodiversity are just some of the consequences associated with pollution.",
            "It is necessary to take measures to counter pollution and protect the environment for future generations."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1704797771332-fca2526315dd?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - consequences of pollution for nature"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Environmental pollution represents a challenge that requires immediate action from individuals, communities, and governments. Only through joint efforts can we stop this critical process and preserve the planet for future generations."
          ]
        }
      ]
    },
    {
      "id": "7",
      "title": "Financial Technologies",
      "subtitle": "Innovations and their impact on the modern financial market",
      "img": "https://images.unsplash.com/photo-1628054330565-7d42aa5ae1fa?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1280,
      "createdAt": "29.08.2022",
      "userId": "1",
      "type": [
        "ECONOMICS",
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Financial Technologies",
          "paragraphs": [
            "Financial technologies (Fintech) represent a combination of innovative technologies used to improve and automate the provision of financial services. This field covers a wide range of services, from mobile banking to cryptocurrencies and blockchain.",
            "Over the past decades, the fintech market has expanded significantly, and its impact on the financial industry has become more evident. The emergence of new players, such as startups and technology companies, has radically changed the traditional approach to financial services.",
            "Financial technologies help increase the accessibility of financial services for consumers and reduce costs for companies."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Financial Technologies</h1>\n    <p>Overview of latest trends in Fintech.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Fintech Branch Trends",
          "paragraphs": [
            "1. Mobile payments: The increased use of smartphones in mobile payments has enabled users to conduct transactions from home, which became especially important during the pandemic.",
            "2. Cryptocurrencies: The growing popularity of Bitcoin and other cryptocurrencies has led to an increase in platforms for exchanging and storing digital assets.",
            "3. Artificial Intelligence: AI and machine learning are actively being implemented to automate processes, detect fraud, and improve customer service."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1628054330565-7d42aa5ae1fa?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - fintech market growth diagram"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const fintechData = require('fintech-data');\n\nconst marketAnalysis = fintechData.getMarketTrends();\n\nconsole.log(marketAnalysis);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Impact of Fintech on Traditional Financial Institutions",
          "paragraphs": [
            "Financial technologies have a significant impact on traditional banks and financial institutions. Some of them are beginning to implement technological innovations to keep up with the latest trends.",
            "Thus, partnerships are being created between banks and fintech companies, which opens up new opportunities for service provision and demonstrates the adaptability of the traditional financial system.",
            "Technological innovations help improve customer experience, as well as enhance the security and efficiency of financial operations."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1628054330565-7d42aa5ae1fa?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - financial technologies and their applications"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Financial technologies continue to evolve and shape the future of financial services. Technological progress opens new opportunities for users, provides greater transparency, and makes financial services more accessible to everyone."
          ]
        }
      ]
    },
    {
      "id": "8",
      "title": "Politics and Society",
      "subtitle": "Analysis of Political Impact on Social Processes",
      "img": "https://images.unsplash.com/photo-1717348427429-e5398af7ae4e?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1147,
      "createdAt": "09.09.2022",
      "userId": "1",
      "type": [
        "POLITICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Politics and Society",
          "paragraphs": [
            "Politics and society are interconnected spheres that influence each other. Political decisions shape people's living conditions and can determine their well-being, rights, and freedoms.",
            "At the same time, social movements and opinions play an important role in shaping the political landscape. Sometimes, public demands force politicians to take urgent measures.",
            "Human rights, social equality, and economic development are key aspects in studying this relationship."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Politics and Society</h1>\n    <p>Overview of political decisions' impact on social processes.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Interaction of Politics and Society",
          "paragraphs": [
            "A country's political system is largely determined by social values and norms. Society expects the state to protect its interests, and the government, in turn, takes these expectations into account when forming its policies.",
            "There are various models of interaction, from authoritarian to democratic, and each affects how citizens perceive the political process.",
            "At the present stage, it's important to pay attention to the role of social media, which is becoming a powerful tool for shaping public opinion and political activity."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1717348427429-e5398af7ae4e?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - protests and social movements"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const politics = require('politics-api');\n\nconst currentIssues = politics.getCurrentIssues();\n\nconsole.log(currentIssues);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Social Movements and Their Influence",
          "paragraphs": [
            "Social movements, such as environmental, feminist, and human rights movements, play an important role in public life. They can significantly influence political decision-making and the formation of state policy.",
            "Through organizing protests, campaigns, and petitions, activists raise important issues, forcing authorities to respond and take action.",
            "Thus, the public becomes not just an observer but an active player in the political process."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1717348427429-e5398af7ae4e?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - impact of social movements"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Politics and society are in constant interaction, and their relationship shapes the future. Openness to dialogue, mutual understanding, and active citizen participation are the keys to stable and harmonious development of society."
          ]
        }
      ]
    },
    {
      "id": "9",
      "title": "Technology Startups",
      "subtitle": "Prospects and Challenges in New Technology Development",
      "img": "https://images.unsplash.com/photo-1587727383733-f5222d6855b5?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 900,
      "createdAt": "11.10.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to the World of Startups",
          "paragraphs": [
            "Today's technology world is filled with innovations, and startups play a key role in this dynamic environment. From mobile applications to artificial intelligence, startups are transforming the business landscape.",
            "Creating a successful startup requires not only an idea but also a comprehensive approach to business planning, financing, and marketing. It's important to be able to adapt to rapidly changing trends and consumer expectations.",
            "Startups also face many challenges, including competition, attracting investment, and managing growth."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Technology Startups</h1>\n    <p>Analysis of current trends and technologies.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Current Trends in Startups",
          "paragraphs": [
            "1. Artificial Intelligence: Startups are increasingly using AI to create intelligent systems that improve service efficiency and quality.",
            "2. Sustainable Development: Environmental startups focused on eco-friendly technologies and sustainable consumption are becoming increasingly popular.",
            "3. Social Innovation: There is a growing focus on startups that address social issues such as education and healthcare."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1587727383733-f5222d6855b5?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - examples of successful startups"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const startupData = require('startup-data');\n\nconst currentTrends = startupData.getTrends();\n\nconsole.log(currentTrends);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Problems and Challenges",
          "paragraphs": [
            "Startups face various problems such as lack of funding, high competition, and uncertainty. Successful entrepreneurs must be ready to adapt and find innovative solutions.",
            "Additionally, they need to understand market needs and respond to changes to remain relevant and competitive."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1587727383733-f5222d6855b5?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - startups in the market"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Technology startups play an important role in shaping the future. They make significant contributions to the economy by creating jobs and bringing new ideas to market. Success in this field requires persistence, innovative thinking, and adaptability."
          ]
        }
      ]
    },
    {
      "id": "10",
      "title": "Ecology and Economics",
      "subtitle": "The relationship between natural resources and economic growth",
      "img": "https://images.unsplash.com/photo-1642940399279-3a0b7f820fe7?q=80&w=2072&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 450,
      "createdAt": "15.11.2022",
      "userId": "1",
      "type": [
        "ECONOMICS",
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Ecology and Economics",
          "paragraphs": [
            "Ecology and economics are interconnected, and their interaction is becoming increasingly relevant in the context of global climate change and depletion of natural resources.",
            "Economic growth is undoubtedly important for the development of countries, but it should not come at the expense of environmental degradation. Sustainable development is an approach that allows combining economic progress with environmental protection.",
            "In this article, we will examine the main aspects of how ecology and economics influence each other, as well as possible ways to achieve harmony between these two spheres."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Ecology and Economics</h1>\n    <p>Analysis of the relationship between natural resources and economic growth.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Environmental Problems and Their Impact on the Economy",
          "paragraphs": [
            "The aggravation of environmental problems such as pollution, loss of biodiversity, and climate change negatively affects economic stability. For example, the increased frequency of natural disasters leads to high infrastructure restoration costs.",
            "At the same time, sustainable environmental management can serve as a basis for new economic growth. Green technologies, development of renewable energy sources, and efficient resource use are becoming not only a necessity but also a business opportunity."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1642940399279-3a0b7f820fe7?q=80&w=2072&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - ecosystem and economy"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const economy = require('economy-data');\n\neconomy.analyzeImpact({ sectors: ['renewable energy', 'agriculture', 'transportation'] });"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Approaches to Sustainable Development",
          "paragraphs": [
            "There are several approaches to sustainable development that can help integrate environmental requirements into economic policy.",
            "1. Legislation: creating and implementing laws protecting nature, and regulations supporting sustainable production and consumption.",
            "2. Innovation: stimulating scientific research and implementing new technologies to reduce negative environmental impact.",
            "3. Education: raising public awareness about the importance of environmental protection and forming responsible attitudes towards resources."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1642940399279-3a0b7f820fe7?q=80&w=2072&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - paths to sustainable development"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Ecology and economics are two sides of the same coin. To achieve a sustainable future, we need to find a balance between economic interests and environmental protection. Only through joint efforts can we create a harmonious society where ecology and economics coexist and complement each other."
          ]
        }
      ]
    },
    {
      "id": "11",
      "title": "Climate Change",
      "subtitle": "Analysis of Current Trends and Global Efforts to Combat Climate Change",
      "img": "https://images.unsplash.com/photo-1579004464832-0c014afa448c?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 300,
      "createdAt": "29.11.2022",
      "userId": "1",
      "type": [
        "POLITICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Climate Change",
          "paragraphs": [
            "Climate change is one of the most serious problems facing our planet. It is caused by both natural processes and human activities.",
            "Climate change affects living conditions, ecosystems and the economy. Understanding these changes and developing effective solutions is now more important than ever.",
            "Global warming, rising sea levels and increasing frequency of extreme weather events are just some of the signs that action needs to be taken."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Climate Change</h1>\n    <p>Overview of main causes and consequences of climate change.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Main Causes of Climate Change",
          "paragraphs": [
            "1. Greenhouse gas emissions: gases such as carbon dioxide and methane accumulate in the atmosphere and create the greenhouse effect.",
            "2. Deforestation: cutting down forests reduces the planet's ability to absorb carbon dioxide.",
            "3. Industrialization: growth in industry and energy consumption leads to increased emissions."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1579004464832-0c014afa448c?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - temperature change graph"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const climateData = require('climate-data');\n\nconst globalTemperatureTrends = climateData.getTemperatureTrends();\n\nconsole.log(globalTemperatureTrends);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Consequences of Climate Change",
          "paragraphs": [
            "Climate change leads to rising sea levels, threatening coastal cities and ecosystems.",
            "The frequency and intensity of natural disasters such as hurricanes and floods may increase.",
            "Climate change also disrupts food supply chains and causes loss of biodiversity."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1579004464832-0c014afa448c?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - consequences of climate change"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion and Actions",
          "paragraphs": [
            "Urgent action is needed to combat climate change: transitioning to renewable energy sources, increasing green spaces, and active environmental protection policies.",
            "Each of us can contribute: from more rational use of resources to supporting environmental protection initiatives."
          ]
        }
      ]
    },
    {
      "id": "12",
      "title": "Cybersecurity",
      "subtitle": "Current threats and protection methods in the digital world",
      "img": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1022,
      "createdAt": "12.12.2022",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Cybersecurity",
          "paragraphs": [
            "Cybersecurity is the practice of protecting computers, servers, mobile devices, systems and data from malicious attacks. With the growing number of cyberattacks each year, the necessity of information protection becomes increasingly relevant.",
            "Cyber threats can take many forms, including viruses, phishing, data theft and zero-day attacks. Understanding these threats is the first step to improving security in the digital space.",
            "The need for cybersecurity becomes especially important in the context of increased remote work and depends on our individual precautions."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Cybersecurity</h1>\n    <p>Main threats and protection methods in the modern world.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Types of Cyber Threats",
          "paragraphs": [
            "1. Malware: programs designed to damage or gain unauthorized access to a system.",
            "2. Phishing: attempts to extract personal data through fake emails or websites.",
            "3. Zero-day attacks: attacks on software vulnerabilities that have not yet been discovered by developers."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - cyberattack growth chart"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const cyberThreats = require('cyber-threats');\n\nconst statistics = cyberThreats.analyzeTrends();\n\nconsole.log(statistics);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Protection Methods",
          "paragraphs": [
            "1. Antivirus software: using antivirus helps protect the system from malicious programs.",
            "2. Two-factor authentication: an additional layer of security requiring identity verification through a second factor.",
            "3. Employee training: the importance of training employees in cybersecurity basics to minimize risks."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - cyber protection schemes"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Cybersecurity is a continuous process requiring constant attention and adaptation to new threats. Understanding different types of threats and actively applying protection methods will help create a more secure digital space."
          ]
        }
      ]
    },
    {
      "id": "13",
      "title": "Artificial Intelligence in Business",
      "subtitle": "How AI is Changing the Business Landscape in 2023",
      "img": "https://images.unsplash.com/photo-1706466614967-f4f14a3d9d08?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 760,
      "createdAt": "20.01.2023",
      "userId": "1",
      "type": [
        "IT",
        "ECONOMICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Artificial Intelligence (AI)",
          "paragraphs": [
            "Artificial Intelligence (AI) has become one of the most discussed topics in business in recent years. It is transforming companies by allowing them to optimize processes, improve services, and make more informed decisions.",
            "AI includes machine learning, natural language processing, and computer vision, which together help analyze data, identify patterns, and make predictions.",
            "In simplified terms, AI allows businesses to use information more effectively, which in turn leads to increased profits and improved competitiveness."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Artificial Intelligence in Business</h1>\n    <p>How AI is changing business approaches in 2023.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "AI Applications Across Industries",
          "paragraphs": [
            "1. **Marketing:** AI helps analyze consumer behavior and personalize marketing campaigns.",
            "2. **Financial Services:** AI is used to predict market trends and assess customer creditworthiness.",
            "3. **Manufacturing:** AI optimizes production chains, predicts inventory needs, and improves product quality."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1706466614967-f4f14a3d9d08?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - AI in Business"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const aiAdoption = require('ai-adoption');\n\naiAdoption.trackTrends({ sectors: ['marketing', 'finance', 'manufacturing'] });"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Benefits and Challenges of AI Implementation",
          "paragraphs": [
            "The benefits of using AI are clear: automation of routine tasks, improved customer service, and reduced operation times. However, there are also a number of challenges, including security risks and the need for trained personnel.",
            "Try implementing AI in your company while carefully assessing potential risks and limitations. It's important to remember that AI is a tool, not an end goal."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1706466614967-f4f14a3d9d08?q=80&w=1780&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - examples of AI usage"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Artificial Intelligence continues to revolutionize the business world. Mastering this tool will be key to survival and prosperity in the competitive environment of the 21st century. The future belongs to those who are ready to adapt and embrace new technologies."
          ]
        }
      ]
    },
    {
      "id": "14",
      "title": "Globalization",
      "subtitle": "Changes and Impact on World Economy and Politics",
      "img": "https://images.unsplash.com/photo-1627215750463-3386c8ed92ee?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 590,
      "createdAt": "25.02.2023",
      "userId": "1",
      "type": [
        "ECONOMICS",
        "POLITICS"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Globalization",
          "paragraphs": [
            "Globalization is a process of integration and interaction between different countries and cultures, encompassing economic, political and cultural spheres. With the emergence of new technologies and increased international trade, globalization has become an integral part of the modern world.",
            "Over the past decade, globalization has significantly changed both developing and developed economies, presenting new opportunities and challenges."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Globalization</h1>\n    <p>Studying the impact of globalization on society.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Positive Aspects of Globalization",
          "paragraphs": [
            "Globalization offers many advantages, such as access to new markets, opportunities for technology and cultural exchange. It also promotes economic growth through increased competitiveness and innovation.",
            "Thanks to globalization, companies can find more efficient ways of production, while consumers gain access to a wider range of goods and services."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1627215750463-3386c8ed92ee?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - global trade"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const globalizationImpact = require('globalization-impact');\n\nconst impactData = globalizationImpact.getData();\n\nconsole.log(impactData);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Negative Consequences of Globalization",
          "paragraphs": [
            "Despite its advantages, globalization also has its drawbacks. The main risks include economic dependence of countries on global markets, loss of local cultures and technologies, as well as negative impacts on ecosystems.",
            "Additionally, globalization can lead to increased inequality, where benefits are received only by certain population groups."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1627215750463-3386c8ed92ee?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - sociocultural aspects of globalization"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Globalization is a complex process that can affect the lives of millions of people worldwide. Understanding both positive and negative aspects of this phenomenon is key to forming effective policies and sustainable development in the future."
          ]
        }
      ]
    },
    {
      "id": "15",
      "title": "The Evolution of Social Media",
      "subtitle": "How Social Networks are Transforming Our World",
      "img": "https://images.unsplash.com/photo-1554177255-61502b352de3?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 450,
      "createdAt": "18.03.2023",
      "userId": "1",
      "type": [
        "POLITICS",
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction",
          "paragraphs": [
            "Social media has fundamentally changed how we communicate, share information, and interact with the world around us. From its humble beginnings to today's complex platforms, social media continues to evolve and shape society.",
            "In this article, we'll explore the impact of social media on various aspects of modern life, from personal relationships to global movements, and examine both its benefits and challenges.",
            "Understanding these changes is crucial for navigating our increasingly connected world."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <div class=\"social-media-stats\">\n      <h2>Global Social Media Usage</h2>\n      <p>Daily active users: 4.9 billion</p>\n      <p>Average time spent: 2.5 hours</p>\n    </div>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "The Power of Connection",
          "paragraphs": [
            "Social media platforms have created unprecedented opportunities for global connection. People can now instantly connect with others across the world, share experiences, and build communities around shared interests.",
            "These digital spaces have become vital tools for business, education, and social movements, demonstrating the transformative power of connected networks."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1554177255-61502b352de3?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Social Media Connectivity"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "// Social Media Analytics\nconst analyzeEngagement = (data) => {\n  return {\n    likes: data.interactions.likes,\n    shares: data.interactions.shares,\n    comments: data.interactions.comments\n  };\n};"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Challenges and Concerns",
          "paragraphs": [
            "Despite its benefits, social media also presents significant challenges. Privacy concerns, misinformation, and digital addiction have become pressing issues that society must address.",
            "The impact on mental health, particularly among younger users, has sparked important discussions about responsible platform design and digital wellness."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1554177255-61502b352de3?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Digital Wellness"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Looking Ahead",
          "paragraphs": [
            "As we look to the future, social media will continue to evolve with emerging technologies like virtual reality and artificial intelligence. Understanding and shaping this evolution will be crucial for creating positive digital spaces that benefit society as a whole."
          ]
        }
      ]
    },
    {
      "id": "16",
      "title": "Social Networks and Society",
      "subtitle": "The Impact of Social Platforms on Modern Society",
      "img": "https://images.unsplash.com/photo-1517292987719-0369a794ec0f?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 450,
      "createdAt": "18.03.2023",
      "userId": "1",
      "type": [
        "POLITICS",
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Social Media Impact",
          "paragraphs": [
            "Social networks have become an integral part of our daily lives. They provide a platform for communication, exchange of ideas and information, and shape modern social movements.",
            "While users enjoy benefits such as the ability to quickly find information and stay connected with loved ones, social networks also bring problems related to misinformation, privacy, and online aggression.",
            "This raises important questions about the influence of social media on public opinion and personal beliefs."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Social Networks and Society</h1>\n    <p>Studying the impact of social platforms on human relationships and culture.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Positive Aspects of Social Networks",
          "paragraphs": [
            "Social networks have created new ways for communication and collaboration. They allow users to share their experiences, get help, and find like-minded people.",
            "Platforms like Facebook, Twitter, and Instagram have become important tools for organizing social movements and activism, demonstrating the power of group dynamics in digital space.",
            "These platforms have helped draw attention to important social issues and shape global public opinion."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1517292987719-0369a794ec0f?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - social media usage"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const socialMediaImpact = require('social-media-impact');\n\nconst analysis = socialMediaImpact.analyzeTrends();\n\nconsole.log(analysis);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Negative Aspects of Social Networks",
          "paragraphs": [
            "One of the main negative consequences is misinformation. Difficulties with source verification make users vulnerable to false information.",
            "Issues with personal data protection and privacy also raise concerns among users, as many companies use information for attention-grabbing and opinion manipulation.",
            "Additionally, instances of cyberbullying and online aggression highlight the importance of creating a safe environment on social networks."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1517292987719-0369a794ec0f?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - dangers of online interaction"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Social networks continue to have a profound impact on our society. We must be aware of both their advantages and disadvantages to use them to our benefit and minimize potential dangers.",
            "Discussing and understanding social networks and their role in our lives is crucial for creating a more constructive and safer online space."
          ]
        }
      ]
    },
    {
      "id": "17",
      "title": "Renewable Energy Sources",
      "subtitle": "The Potential and Future of Clean Energy",
      "img": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 858,
      "createdAt": "05.10.2023",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Renewable Energy Sources",
          "paragraphs": [
            "Renewable energy sources are becoming increasingly relevant in light of global climate issues and depletion of natural resources. They offer a sustainable alternative to traditional fossil fuels and can significantly reduce carbon emissions.",
            "The popularity of renewable energy sources continues to grow as technologies become more accessible and efficient. These resources include solar, wind, hydroelectric, biomass and geothermal energy."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Renewable Energy Sources</h1>\n    <p>Overview of key sources and their future in energy.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Types of Renewable Energy Sources",
          "paragraphs": [
            "1. Solar energy: uses solar panel technology to convert sunlight into electricity. This is one of the fastest growing sectors in renewable energy.",
            "2. Wind energy: wind turbines convert the kinetic energy of wind into electricity. This sector is also seeing significant growth, especially in Europe and North America.",
            "3. Hydroelectric power: creating power plants on rivers and water bodies allows converting the power of flowing water into electrical energy."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - solar panels on roof"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const renewableEnergy = require('renewable-energy');\n\nconst energyStats = renewableEnergy.getStatistics();\n\nconsole.log(energyStats);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Benefits and Challenges",
          "paragraphs": [
            "The benefits of renewable energy sources are very clear: reduced carbon emissions, decreased dependence on fossil fuels, and creation of new jobs in the green economy sector.",
            "However, there are also challenges, such as the need for infrastructure investment, research and development to improve technology efficiency, and creation of energy storage batteries."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - wind turbines at sunset"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Renewable energy sources represent not only a solution to current environmental problems but also an important step towards a sustainable future. Technologies continue to develop and improve, opening new horizons for humanity."
          ]
        }
      ]
    },
    {
      "id": "18",
      "title": "Climate Change",
      "subtitle": "Analysis of Long-term Effects of Global Warming",
      "img": "https://images.unsplash.com/photo-1454789476662-53eb23ba5907?q=80&w=1952&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1200,
      "createdAt": "15.02.2023",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "What is Climate Change?",
          "paragraphs": [
            "Climate change refers to long-term changes in Earth's temperature, precipitation, and other weather conditions. It is linked to both natural processes and human activities, which have significantly accelerated this process.",
            "Currently, we are observing rising average temperatures on the planet, increased frequency of extreme weather events, and changes in ecosystems. These changes have serious impacts on human and animal life.",
            "Understanding the causes and consequences of climate change is crucial for ensuring a sustainable future."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Climate Change</h1>\n    <p>Overview of causes and impacts of global warming.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Causes of Climate Change",
          "paragraphs": [
            "1. Greenhouse gases: emissions of carbon dioxide and methane from industrial processes, transportation, and agriculture lead to the accumulation of greenhouse gases in the atmosphere.",
            "2. Deforestation: destruction of forests reduces the planet's ability to absorb carbon dioxide, exacerbating the situation.",
            "3. Intensive agriculture: the use of fertilizers and pesticides increases greenhouse gas emissions and leads to soil degradation."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1454789476662-53eb23ba5907?q=80&w=1952&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - temperature rise graph"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const climateChangeData = require('climate-change-data');\n\nconst globalTemperature = climateChangeData.getGlobalTemperatureTrends();\n\nconsole.log(globalTemperature);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Consequences of Climate Change",
          "paragraphs": [
            "Climate change leads to rising sea levels, threatening coastal areas. This can result in flooding of homes, infrastructure, and ecosystems.",
            "Additionally, climate changes increase the likelihood of natural disasters such as hurricanes, floods, and droughts, which damage agriculture and the economy.",
            "Climate change also affects biodiversity, endangering many plant and animal species that are unable to adapt to rapidly changing conditions."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1454789476662-53eb23ba5907?q=80&w=1952&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - consequences of climate change"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Climate change is a global problem that requires collective efforts to solve. Understanding the scale and consequences of climate change will help each of us make a positive contribution to protecting our planet.",
            "Only through joint efforts can we create a sustainable future and protect the environment for future generations."
          ]
        }
      ]
    },
    {
      "id": "19",
      "title": "Climate Change",
      "subtitle": "Challenges Facing Humanity and Possible Solutions",
      "img": "https://images.unsplash.com/photo-1624324378932-68e20f332982?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1200,
      "createdAt": "15.08.2022",
      "userId": "1",
      "type": [
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Climate Change",
          "paragraphs": [
            "Climate change is one of the most significant challenges facing modern humanity. Sharp increases in global temperatures, changes in weather patterns, and the frequency of extreme events threaten not only ecosystems but human existence itself.",
            "The main cause of these changes is human activity, including greenhouse gas emissions, deforestation, and environmental pollution. Understanding and acknowledging the scale of the problem is crucial for developing effective solutions."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Climate Change</h1>\n    <p>Overview of the problem's scale and possible solutions.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Causes of Climate Change",
          "paragraphs": [
            "1. Greenhouse gas emissions: burning fossil fuels such as coal, oil, and gas is the main source of carbon dioxide, which exacerbates the greenhouse effect.",
            "2. Deforestation: destruction of forests leads to fewer trees absorbing carbon dioxide and disrupts ecosystems.",
            "3. Industrial agriculture: the use of fertilizers and pesticides ensures increased production but also increases gas emissions such as methane and nitrous oxide."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1624324378932-68e20f332982?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - global warming"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const climateData = require('climate-data');\n\nconst globalTemperature = climateData.getGlobalTemperatureTrend();\n\nconsole.log(globalTemperature);"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Consequences of Climate Change",
          "paragraphs": [
            "Climate change causes increased frequency and intensity of extreme weather events such as floods, hurricanes, and droughts. These events cause significant damage to economies and ecosystems.",
            "There are also changes in natural ecosystems, leading to species extinction and disruption of natural balance. Climate change threatens resources on which human life depends, including fresh water and food."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1624324378932-68e20f332982?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - consequences of climate change"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Possible Solutions",
          "paragraphs": [
            "To combat climate change, comprehensive strategies need to be developed, including transitioning to renewable energy sources such as solar and wind power.",
            "Other solutions include protecting and restoring forests, improving agricultural technologies, and international cooperation to reduce greenhouse gas emissions and achieve sustainable development goals.",
            "Each of us can contribute, starting with simple steps such as reducing plastic consumption and using public transportation."
          ]
        }
      ]
    },
    {
      "id": "20",
      "title": "Energy in the XXI Century",
      "subtitle": "Trends and Technologies of the Future",
      "img": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 900,
      "createdAt": "15.01.2023",
      "userId": "1",
      "type": [
        "SCIENCE",
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to XXI Century Energy",
          "paragraphs": [
            "The age of rapid technological development leads to the need to rethink energy sources. The main challenges of the era are sustainability and accessibility.",
            "Modern technologies allow for more efficient use of renewable energy sources, reducing dependence on fossil resources."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Energy in the XXI Century</h1>\n    <p>Analysis of energy sources and technologies.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "In-Demand Energy Sources",
          "paragraphs": [
            "Methods of energy production are changing. Solar panels, wind farms, and other alternative sources are becoming increasingly popular.",
            "Investment in green energy technologies shows promising results and leads to economic benefits in the long term."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - solar panels"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const energySources = ['solar', 'wind', 'geothermal', 'hydro'];\n\nenergySources.forEach(source => console.log(`Sustainable source: ${source}`));"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Prospects and Challenges",
          "paragraphs": [
            "The need to implement new technologies requires management decisions at the level of states and organizations.",
            "The transition to sustainable energy sources may face economic and social challenges requiring adaptation."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1506748686214-e9df14d4d9d0?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - wind farms"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The future of energy depends on addressing key issues related to sustainability and adaptation. XXI century energy must be clean, accessible, and efficient for everyone."
          ]
        }
      ]
    },
    {
      "id": "21",
      "title": "The Future of Transportation",
      "subtitle": "New Technologies and Their Impact on Public Transport",
      "img": "https://images.unsplash.com/photo-1473042904451-00171c69419d?q=80&w=2099&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 800,
      "createdAt": "20.01.2023",
      "userId": "1",
      "type": [
        "SCIENCE",
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Transportation in the XXI Century",
          "paragraphs": [
            "Modern technologies are transforming the transportation industry at a faster pace than ever before. The emergence of electric vehicles, autonomous vehicles, and high-speed trains is changing the way we think about mobility.",
            "Environmental concerns are an important aspect, and new developments are being considered in light of the need to reduce emissions and energy consumption."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>The Future of Transportation</h1>\n    <p>Analysis of new technologies and their impact on the transportation system.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Technological Innovations",
          "paragraphs": [
            "Transport electrification: electric vehicles are gaining popularity due to improved battery technology. They are becoming more accessible and efficient, changing the demand for traditional vehicles.",
            "Autonomous technologies: self-driving cars are beginning to be integrated into the transportation system, promising to improve safety and reduce accidents."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1473042904451-00171c69419d?q=80&w=2099&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - electric vehicles"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const transportInnovations = ['electric cars', 'drones', 'hyperloop'];\n\ntransportInnovations.forEach(innovation => console.log(`Innovation: ${innovation}`));"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Impact on Public Transport",
          "paragraphs": [
            "The intensive development of new technologies can make public transport more accessible and efficient.",
            "The use of intelligent transport management systems helps optimize routes and reduce delays."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1473042904451-00171c69419d?q=80&w=2099&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - autonomous vehicles"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The future of transportation depends on the implementation of new technologies that will help make mobility safer, more efficient, and environmentally friendly."
          ]
        }
      ]
    },
    {
      "id": "22",
      "title": "Development of Robotics",
      "subtitle": "Technological Achievements and Their Applications",
      "img": "https://images.unsplash.com/photo-1518314916381-77a37c2a49ae?q=80&w=2071&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 751,
      "createdAt": "05.02.2023",
      "userId": "1",
      "type": [
        "SCIENCE",
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Rapid Development of Robotics",
          "paragraphs": [
            "Robotics is becoming an important part of our lives. From manufacturing to medicine, robots are being used in a wide variety of fields.",
            "Thanks to new technologies and algorithms, modern robotics is reaching levels that could only be dreamed of before."
          ]
        },
        {
          "id": "4",
          "type": "CODE",
          "code": "<!DOCTYPE html>\n<html>\n  <body>\n    <h1>Development of Robotics</h1>\n    <p>Analysis of technological achievements in robotics.</p>\n  </body>\n</html>;"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Modern Achievements",
          "paragraphs": [
            "Lightweight and multifunctional robots are now used in manufacturing processes, increasing productivity and quality.",
            "In medicine, robots assist in performing surgeries, improving accuracy and reducing patient recovery time."
          ]
        },
        {
          "id": "2",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1518314916381-77a37c2a49ae?q=80&w=2071&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - surgical robot"
        },
        {
          "id": "3",
          "type": "CODE",
          "code": "const roboticsApplications = ['healthcare', 'manufacturing', 'exploration'];\n\nroboticsApplications.forEach(application => console.log(`Application: ${application}`));"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Future of Robotics",
          "paragraphs": [
            "The prospects for robotics development are enormous. Every day robots become smarter and capable of performing complex tasks.",
            "The development of software and artificial intelligence systems will contribute to the further integration of robots into everyday life."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1518314916381-77a37c2a49ae?q=80&w=2071&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - robot in manufacturing"
        },
        {
          "id": "9",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The development of robotics continues to open new horizons for humanity. The possibilities for robot applications seem limitless and continue to increase with each passing year."
          ]
        }
      ]
    },
    {
      "id": "23",
      "title": "The Future of Green Technologies ",
      "subtitle": "How Sustainable Technologies are Changing Our World ssws",
      "img": "https://images.unsplash.com/photo-1533413598044-92e0b8e24cbc?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 841,
      "createdAt": "02.08.2023",
      "userId": "1",
      "type": [
        "IT",
        "SCIENCE"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Green Technologies",
          "paragraphs": [
            "Green technologies are innovations aimed at reducing the impact of human activities on the environment. They include renewable energy sources, waste recycling, and sustainable agriculture.",
            "With population growth and increasing resource consumption, it is becoming increasingly evident that traditional methods of production and consumption are no longer viable. Therefore, the transition to green technologies is becoming a necessity."
          ]
        },
        {
          "id": "2",
          "type": "CODE",
          "code": "const greenTech = require('green-tech');\n\nconst innovations = greenTech.getRecentInnovations();\n\nconsole.log(innovations);"
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Main Areas of Green Technologies",
          "paragraphs": [
            "1. Renewable Energy: solar, wind, and hydropower provide clean energy and help reduce carbon emissions.",
            "2. Sustainable Construction: use of environmentally friendly materials and technologies, such as green roofs and energy-efficient systems.",
            "3. Recycling and Waste Management: new methods of recycling and waste reduction help minimize negative environmental impact."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1533413598044-92e0b8e24cbc?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - solar panels"
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Benefits of Green Technologies",
          "paragraphs": [
            "1. Pollution Reduction: reducing carbon dioxide emissions and other pollutants helps improve air quality.",
            "2. Economic Benefits: sustainable technologies can reduce energy costs and improve energy efficiency.",
            "3. Protection of Natural Resources: using renewable resources helps preserve finite resources for future generations.",
            "4. Protection of Natural Resources: using renewable resources helps preserve finite resources for future generations."
          ]
        },
        {
          "id": "6",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1533413598044-92e0b8e24cbc?q=80&w=1932&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - waste recycling"
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The future of green technologies looks promising. Innovations in this field have the potential to transform our economy and way of life. Adopting sustainable technologies will be an important step towards a healthier and more sustainable future."
          ]
        }
      ],
      "user": {
        "id": "1",
        "username": "admin",
        "password": "123",
        "roles": [
          "ADMIN"
        ],
        "features": {
          "isAppRedesigned": true
        },
        "jsonSettings": {
          "isArticlePageWasOpened": true
        },
        "avatar": "https://images.unsplash.com/photo-1438761681033-6461ffad8d80?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
      },
      "currentBlock": {
        "id": "5",
        "type": "TEXT",
        "title": "Benefits of Green Technologies",
        "paragraphs": [
          "1. Pollution Reduction: reducing carbon dioxide emissions and other pollutants helps improve air quality.",
          "2. Economic Benefits: sustainable technologies can reduce energy costs and improve energy efficiency.",
          "3. Protection of Natural Resources: using renewable resources helps preserve finite resources for future generations.",
          "4. Protection of Natural Resources: using renewable resources helps preserve finite resources for future generations."
        ]
      },
      "tabValue": ""
    },
    {
      "id": "24",
      "title": "Cybersecurity Fundamentals",
      "subtitle": "Understanding Basic Concepts and Threats",
      "img": "https://images.unsplash.com/photo-1510915228340-29c85a43dcfe?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 1200,
      "createdAt": "15.02.2025",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to Cybersecurity",
          "paragraphs": [
            "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks. These attacks typically aim to access, change, or destroy sensitive information.",
            "Understanding the basic concepts and threats in this field is essential for any organization seeking to protect its assets and ensure data security."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Types of Threats",
          "paragraphs": [
            "1. Viruses and Malware: programs that damage or disrupt computer operations.",
            "2. Phishing: method of stealing personal data through deceptive emails or websites.",
            "3. Distributed Denial of Service (DDoS): blocking access to resources by overloading servers."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1510915228340-29c85a43dcfe?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 1 - types of cyber threats"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "Given the growing number of cyber threats, it is essential to pay close attention to cybersecurity. It is important to be aware of potential attacks and take appropriate measures to protect data."
          ]
        }
      ]
    },
    {
      "id": "25",
      "title": "Online Safety Tips",
      "subtitle": "How to Protect Yourself in the Digital World",
      "img": "https://images.unsplash.com/photo-1590065707046-4fde65275b2e?q=80&w=1930&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 950,
      "createdAt": "20.02.2025",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction",
          "paragraphs": [
            "The state of cyber threats requires internet users to be vigilant and know the basic principles of security. How can you protect yourself when using digital technologies?",
            "This article presents some practical security tips that will help you protect your data and personal information."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Recommendations",
          "paragraphs": [
            "1. Use strong passwords and change them regularly.",
            "2. Enable two-factor authentication whenever possible.",
            "3. Never share your personal data through suspicious links and emails.",
            "4. Regularly update software on all devices."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1590065707046-4fde65275b2e?q=80&w=1930&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 2 - online safety tips"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "By following these recommendations, you can significantly improve your online security. Stay vigilant and always protect your data!"
          ]
        }
      ]
    },
    {
      "id": "26",
      "title": "The Future of Cybersecurity",
      "subtitle": "Trends and Technologies That Will Define Cyber Protection",
      "img": "https://images.unsplash.com/photo-1605918321371-584f5deab0a2?q=80&w=2071&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "views": 780,
      "createdAt": "25.02.2025",
      "userId": "1",
      "type": [
        "IT"
      ],
      "blocks": [
        {
          "id": "1",
          "type": "TEXT",
          "title": "Introduction to the Future of Cybersecurity",
          "paragraphs": [
            "Cybersecurity is a rapidly evolving field with various new technologies and methodologies aimed at protecting against cyber threats. What path will this field take in the coming years?",
            "In this article, we will explore the key trends and innovations that will shape the future of cybersecurity."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Key Trends",
          "paragraphs": [
            "1. Increased use of AI for threat detection and prevention.",
            "2. Growing number of cyberattacks on Internet of Things (IoT) devices.",
            "3. Increasing need for cyber risk management at the business level.",
            "4. Development of legal frameworks and data security standards."
          ]
        },
        {
          "id": "3",
          "type": "IMAGE",
          "src": "https://images.unsplash.com/photo-1605918321371-584f5deab0a2?q=80&w=2071&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
          "title": "Figure 3 - the future of cybersecurity"
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "Conclusion",
          "paragraphs": [
            "The future of cybersecurity is tied to the rapid development of technology and changes in protection approaches. Continuous updating of knowledge and skills in this field will become an important aspect for security professionals."
          ]
        }
      ]
    }
  ],
  "comments": [
    {
      "articleId": "1",
      "userId": "1",
      "text": "123",
      "id": "4Cljjzl"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "123asfasf",
      "id": "AEM4Dvc"
    },
    {
      "articleId": "3",
      "userId": "1",
      "text": "comment 1",
      "id": "bAs7YBE"
    },
    {
      "articleId": "2",
      "userId": "1",
      "text": "python!!!",
      "id": "p5rMadd"
    },
    {
      "articleId": "10",
      "userId": "1",
      "text": "sqsqsqs",
      "id": "lz_wSi-"
    },
    {
      "articleId": "9",
      "userId": "2",
      "text": "hi",
      "id": "CXHIfV9"
    },
    {
      "articleId": "3",
      "userId": "2",
      "text": "f",
      "id": "xzJQCd8"
    },
    {
      "articleId": "8",
      "userId": "2",
      "text": "hi!",
      "id": "Ibo3hDs"
    },
    {
      "articleId": "8",
      "userId": "1",
      "text": "hello",
      "id": "1UYxKGn"
    },
    {
      "articleId": "14",
      "userId": "2",
      "text": "hi!",
      "id": "Wogu4Yg"
    },
    {
      "articleId": "7",
      "userId": "1",
      "text": "sgsgsgs",
      "id": "UVqm6Qk"
    },
    {
      "articleId": "11",
      "userId": "1",
      "text": "efdfdfdf",
      "id": "g48cOtD"
    },
    {
      "articleId": "19",
      "userId": "1",
      "text": "hi",
      "id": "ofu-8_w"
    },
    {
      "articleId": "19",
      "userId": "1",
      "text": "dydywdg",
      "id": "dTo-hm8"
    },
    {
      "articleId": "19",
      "userId": "2",
      "text": "sqsqs",
      "id": "x2m7HFz"
    },
    {
      "articleId": "19",
      "userId": "1",
      "text": "gygdfyg",
      "id": "mPdsJJB"
    },
    {
      "articleId": "19",
      "userId": "1",
      "text": "dwdwd",
      "id": "I13ZL1i"
    },
    {
      "articleId": "19",
      "userId": "1",
      "text": "wdwd",
      "id": "joHhVl4"
    },
    {
      "text": "sqsqs efef sqsq dwdwd",
      "id": "HdYvzZu"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "",
      "id": "DCESBie"
    },
    {
      "articleId": "1",
      "userId": "2",
      "text": "sqs  ",
      "id": "L6uYL2l"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "dwdwdwd",
      "id": "xKB6-9o"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "dwd",
      "id": "WkqPfBH"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "123",
      "roles": [
        "ADMIN"
      ],
      "features": {
        "isAppRedesigned": true
      },
      "jsonSettings": {
        "isArticlePageWasOpened": true
      },
      "avatar": "https://images.unsplash.com/photo-1438761681033-6461ffad8d80?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": "2",
      "username": "user",
      "password": "123",
      "roles": [
        "USER"
      ],
      "features": {
        "isArticleRatingEnabled": false,
        "isCounterEnabled": true,
        "isAppRedesigned": false
      },
      "jsonSettings": {
        "isArticlePageWasOpened": true,
        "theme": "light"
      },
      "avatar": "https://plus.unsplash.com/premium_photo-1664536392779-049ba8fde933?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": "3",
      "username": "manager",
      "password": "123",
      "roles": [
        "MANAGER"
      ],
      "features": {
        "isArticleRatingEnabled": true,
        "isCounterEnabled": false,
        "isAppRedesigned": false
      },
      "jsonSettings": {
        "theme": "dark",
        "isArticlePageWasOpened": true
      },
      "avatar": "https://images.unsplash.com/photo-1664575600397-88e370cb46b8?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    },
    {
      "id": "4",
      "username": "testuser",
      "password": "123",
      "roles": [
        "ADMIN"
      ],
      "avatar": "https://images.unsplash.com/photo-1664575600397-88e370cb46b8?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  ],
  "profile": [
    {
      "id": "1",
      "firstname": "user 113",
      "lastname": "dwdwdss1",
      "age": 24,
      "currency": "EUR",
      "city": "New York",
      "username": "admin",
      "avatar": "https://images.unsplash1.com/photo-1438761681033-6461ffad8d80?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "country": "Germany"
    },
    {
      "id": "2",
      "firstname": "user 23ss",
      "lastname": "bhbhbhb",
      "age": 24,
      "currency": "KZT",
      "city": "New York",
      "username": "admin",
      "avatar": "https://plus.unsplash.com/premium_photo-1664536392779-049ba8fde933?q=80&w=1887&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "country": "USA"
    },
    {
      "id": "3",
      "firstname": "manager 23",
      "lastname": "dwdwd",
      "age": 24,
      "currency": "KZT",
      "city": "New York",
      "username": "manager",
      "avatar": "https://images.unsplash.com/photo-1664575600397-88e370cb46b8?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "country": "USA"
    },
    {
      "id": "4",
      "firstname": "test",
      "lastname": "user",
      "age": 24,
      "currency": "KZT",
      "city": "New York",
      "username": "testuser",
      "avatar": "https://images.unsplash.com/photo-1664575600397-88e370cb46b8?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "country": "USA"
    }
  ],
  "article-ratings": [
    {
      "userId": "1",
      "articleId": "6",
      "rate": 2,
      "id": 1
    },
    {
      "userId": "1",
      "articleId": "1",
      "rate": 1,
      "feedback": "qsqs",
      "id": 2
    },
    {
      "userId": "1",
      "articleId": "4",
      "rate": 2,
      "feedback": "dwdwd",
      "id": 3
    },
    {
      "userId": "1",
      "articleId": "23",
      "rate": 3,
      "feedback": "",
      "id": 4
    }
  ],
  "profile-ratings": [
    {
      "id": "1",
      "rate": 4,
      "feedback": "Good profile",
      "userId": "1",
      "profileId": "1"
    },
    {
      "id": "2",
      "rate": 5,
      "feedback": "Good profile",
      "userId": "1",
      "profileId": "2"
    }
  ]
}